In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv('./raw/cb1_allcases.csv')

In [3]:
dataset.head()

,Unnamed: 0,is_male,has_eaten,sd,wt,dp_mins,bac,class,id_code
0,0,1,0,4.0,79.0,122.0,0.053935,under,2079.29
1,1,1,0,5.0,74.0,110.0,0.085175,over,3466.61
2,2,1,0,5.0,75.0,74.0,0.092672,over,2571.66
3,3,1,1,4.0,83.0,119.0,0.058116,under,2296.03
4,4,1,0,8.0,76.0,85.0,0.154285,over,7973.47

In [4]:
len(dataset)

2000

In [5]:
dataset.tail()

,Unnamed: 0,is_male,has_eaten,sd,wt,dp_mins,bac,class,id_code
1995,1995,1,0,4.0,85.0,107.0,0.051725,under,1881.74
1996,1996,0,1,3.0,67.0,110.0,0.065716,under,1452.98
1997,1997,1,1,6.0,87.0,80.0,0.102506,over,4280.65
1998,1998,0,1,1.0,66.0,115.0,0.005824,under,44.20
1999,1999,1,1,7.0,90.0,56.0,0.123201,over,4346.54

In [6]:
dataset = dataset.drop(["Unnamed: 0", "bac", "id_code"], axis=1)

In [7]:
dataset.head()

   is_male  has_eaten   sd    wt  dp_mins  class
0        1          0  4.0  79.0    122.0  under
1        1          0  5.0  74.0    110.0   over
2        1          0  5.0  75.0     74.0   over
3        1          1  4.0  83.0    119.0  under
4        1          0  8.0  76.0     85.0   over

In [8]:
dataset = dataset.replace({'is_male': {1: 'Male', 0: 'Female'}})
dataset = dataset.replace({'has_eaten': {1: 'Yes', 0: 'No'}})
dataset = dataset.replace({'class': {'over': 1, 'under': 0}})

In [9]:
dataset.columns = ['gender', 'meal', 'units_consumed', 'weight', 'duration', 'class']

In [10]:
dataset.head()

  gender meal  units_consumed  weight  duration  class
0   Male   No             4.0    79.0     122.0      0
1   Male   No             5.0    74.0     110.0      1
2   Male   No             5.0    75.0      74.0      1
3   Male  Yes             4.0    83.0     119.0      0
4   Male   No             8.0    76.0      85.0      1

In [11]:
dataset.shape

(2000, 6)

In [13]:
# check for null values
dataset.isnull().values.any()

False

In [14]:
dataset.duplicated().sum()

49

In [16]:
# remove duplicates
dataset = dataset.drop_duplicates()

In [17]:
dataset.duplicated().sum()

0

In [18]:
dataset.shape

(1951, 6)

In [30]:
#dataset.to_csv("blood_alcohol.csv",index=False)